<?php

return [

  /*
    |--------------------------------------------------------------------------
    | バリデーション言語行
    |--------------------------------------------------------------------------
    */

  'required' => ':attributeを入力してください',
  'min' => [
    'string' => ':attributeは:min文字以上で入力してください',
  ],
  'same' => ':attributeと:otherが一致しません',

  /*
    |--------------------------------------------------------------------------
    | カスタム属性名
    |--------------------------------------------------------------------------
    | :attribute プレースホルダを人間にわかりやすい日本語に変換
    */
  'attributes' => [
    'name' => 'お名前',
    'email' => 'メールアドレス',
    'password' => 'パスワード',
    'password_confirmation' => 'パスワード',
  ],

];
